#โปรแกรมหาค่า BMI ดัชนีมวลกาย
#BMI = น้ำหนัก(kg)/ส่วนสูงยกำลัง2(m)
weight = int(input("ป้อนน้ำหนักของคุณ(kg):"))
high= int(input("ป้อนน้ำหนักของคุณ(cm):"))/100
bmi = weight/(high**2)
'''
<18=ต่ำกว่ามาตราฐาน
18.5-22.9= สมส่วน
23.0-24.9= น้ำหนักเกิน
25.0-29.9= โรคอ้วนระดับ1
>30 = โรคอ้วนอันตราย
'''
if bmi <18:
    print("ค่า BMI ของคุณคือ",bmi,"ต่ำกว่ามาตราฐาน")
elif bmi >=18.5 and bmi<=22.9 :
    print("ค่า BMI ของคุณคือ",bmi,"สมส่วน")
elif bmi >=23 and bmi<=24.9:
    print("ค่า BMI ของคุณคือ",bmi,"น้ำหนักเกิน")
elif bmi >=25 and bmi<=29.9 :
    print("ค่า BMI ของคุณคือ",bmi,"โรคอ้วนระดับ1")
elif bmi >30 :
    print("ค่า BMI ของคุณคือ",bmi,"โรคอ้วนระดับอันตราย")
else:
    print("ไม่ทราบค่า")
print("จบโปรแกรม")
